import { defineConfig } from 'tsup';

export default defineConfig((_options) => ({
  name: 'kisuke.vim',
  entry: ['src/index.ts', 'src/llm/mcp/server/*'],
  format: ['esm'],
  banner: {
    js: `/**
*
*   ██ ▄█▀ ██▓  ██████  █    ██  ██ ▄█▀▓█████
*    ██▄█▒ ▓██▒▒██    ▒  ██  ▓██▒ ██▄█▒ ▓█   ▀
*   ▓███▄░ ▒██▒░ ▓██▄   ▓██  ▒██░▓███▄░ ▒███
*   ▓██ █▄ ░██░  ▒   ██▒▓▓█  ░██░▓██ █▄ ▒▓█  ▄
*   ▒██▒ █▄░██░▒██████▒▒▒▒█████▓ ▒██▒ █▄░▒████▒
*   ▒ ▒▒ ▓▒░▓  ▒ ▒▓▒ ▒ ░░▒▓▒ ▒ ▒ ▒ ▒▒ ▓▒░░ ▒░ ░
*   ░ ░▒ ▒░ ▒ ░░ ░▒  ░ ░░░▒░ ░ ░ ░ ░▒ ▒░ ░ ░  ░
*   ░ ░░ ░  ▒ ░░  ░  ░   ░░░ ░ ░ ░ ░░ ░    ░
*   ░  ░    ░        ░     ░     ░  ░      ░  ░
*
**/`
  },
  outDir: 'dist',
  target: 'node25',
  platform: 'node',
  clean: true,
  sourcemap: 'inline'
}));
